#include <bits/stdc++.h>
using namespace std;
//枚举一个数字a，算出另外两个数字b、c，判断是否有相同数字
int s[10];
int main(){
	for (int i = 1; i <= 9; i++)
		for (int j = 1; j <= 9; j++)
			for (int k = 1; k <= 9; k++){
				int a = i * 100 + j * 10 + k, b = a * 2, c = a * 3;
				//构建一个三位数，手动构建其2倍数和3倍数
				if (i != j && j != k && i != k && c <= 999){
					memset(s, 0, sizeof(s));//每次枚举一个数字a后都将数组s清0

					s[0] = 1;//不含0
					s[i] = 1; s[j] = 1; s[k] = 1;//将a使用过的数字对应数组位置设为1
					if (s[b % 10] == 0 && s[b / 10 % 10] == 0 && s[b / 100] == 0){
						//当组成数字b的三个数字没有被使用时进入if
						s[b % 10] = s[b / 10 % 10] = s[b / 100] = 1;
						///将b使用过的数字对应数组位置设为1
						if (s[c % 10] == 0 && s[c / 10 % 10] == 0 && s[c / 100] == 0){
							//当组成数字c的三个数字没有被使用时进入if此时三个数的组成数字都不同
							cout << a << ' ' << b << ' ' << c << endl;
						}
					}
				}
			}
	return 0;
}